eisup_2019_docmng_integration/src/InformationRegisters/абс_ПроектыРезервовРНПДПоЗЗ/абс_ПроектыРезервовРНПДПоЗЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ПроектыРезервовРНПДПоЗЗ</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРНП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьНоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗакупочныйЗаказ</name>
    <type>
      <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_ПериодВозникновенияЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_КВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_ОбъектБюджетирования</name>
    <type>
      <types>CatalogRef.ttk_ОбъектыБюджетирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_Город</name>
    <type>
      <types>CatalogRef.ttk_Города</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_ВидыДокументовРНПД/абс_ВидыДокументовРНПД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыДокументовРНПД</name>
  <enumValues>
    <name>ПоДирекции</name>
  </enumValues>
  <enumValues>
    <name>ПоЦФО</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ПроектыРезервовРНПДПоЗЗ/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	ТекПользователь 	= глЗначениеПеременной("глТекущийПользователь");
	РолиПользователя 	= Новый Массив;
	ТекЗЗ 				= Документы.абс_ЗакупочныйЗаказ.ПустаяСсылка();
	
	ДатаЗапретаРНПД	    = Константы.абс_ГраницаЗапретаРНПД.Получить();
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		
		ТекЗапись = ЭтотОбъект[0];
		
		ЦФООтветственного 	= абс_БизнесПроцессы.ПолучитьОтветственныхРНПДПоЦФО(ТекПользователь, ТекЗапись.Организация, Перечисления.абс_ВидыДокументовРНПД.ПоДирекции);		
		РолиПользователя 	= абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(ТекПользователь, ТекЗапись.Организация);
		ТекЗЗ 				= ТекЗапись.ЗакупочныйЗаказ;
		
	КонецЕсли;	
	
	СписокПериодов = ЭтотОбъект.ВыгрузитьКолонку("Период");
	
	ТабСтатусовРНПД = абс_БизнесПроцессы.ПолучитьСтатусРНПДИзЗЗ(ТекЗЗ, СписокПериодов);
	
	НарушенаГраницаЗапретаРНПД = Ложь;
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		
		Если ТекЗапись.Период < ДатаЗапретаРНПД И ЗначениеЗаполнено(ДатаЗапретаРНПД) Тогда
			
			НарушенаГраницаЗапретаРНПД = Истина;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекЗапись.Ответственный) Тогда
			
			ТекЗапись.Ответственный = ТекПользователь;
			
		КонецЕсли;
		 //ххх Брель Виктор Андреевич 31.05.2018 19:04:17, заявка <<<
		Если НЕ ЗначениеЗаполнено(ТекЗапись.ttk_ПериодВозникновенияЗадолженности) Тогда
			Отказ = Истина;
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не заполнен период возникновения задолженности ", Отказ);		
		КонецЕсли;

		 // Брель Виктор Андреевич 31.05.2018 19:04:17 >>>
		 
		Если НЕ ЗначениеЗаполнено(ТекЗапись.Организация) И ЗначениеЗаполнено(ТекЗапись.ЗакупочныйЗаказ) Тогда
			
			ТекЗапись.Организация = ТекЗапись.ЗакупочныйЗаказ.Организация;
			
		КонецЕсли;
		
		Если (ЦФООтветственного.Найти(ТекЗапись.ЗакупочныйЗаказ.ЦФО) = Неопределено) И (РолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользовательРНПД) = Неопределено) Тогда
			
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не достаточно прав для ввода данных по ЦФО ", Отказ);
			
		КонецЕсли;
				
	КонецЦикла;
	
	Если НарушенаГраницаЗапретаРНПД Тогда
		
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Нарушена граница запрета ввода РНПД.", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры
